<html>
<body>
<?php

$radius=5;
echo "да приемем че радиуса е следния: ".$radius."<br>";

$plosht = pi() * $radius ** 2;
echo "формулата за площ на кръг е следната S = π ⋅ r 2, следователно, ако вземем радуса ни и го умножим по пи и на втора степен ще получим следния резултат : ".$plosht."<br>";

$obikolka = 2 * pi() * $radius;
echo "формулата за обиколката на кръг е следната π.диаметър=2.π.радиус=π.диаметър=2.π.радиус, следователно като вземем радиуса и следваме формулата ще получим : ".$obikolka."<br>";

?>
</body>
</html>