<html>
<body>
<?php

$a = 1;
$b = 5;
$c = 6;

$d = $b * $b - 4 * $a * $c;
echo "Нека изчислим дискриминантата с формулата $b^2 - 4ac. С текущите променливи D = $d<br>";

if ($d > 0) {
  $root1 = (-$b + sqrt($d)) / (2 * $a);
  $root2 = (-$b - sqrt($d)) / (2 * $a);
  echo "за първия корен ще използваме следната формула на Виет: (-$b + sqrt($d)) / (2 * $a)<br>";
  echo "за втория корен ще използваме другата формула на Виет: (-$b - sqrt($d)) / (2 * $a)<br>";
  echo "Корените на уравнението са: x1 = " . $root1 . ", x2 = " . $root2;
} elseif ($d == 0) {
  $root = -$b / (2 * $a);
  echo "Уравнението има един двоен корен: x = " . $root;
} else {
  echo "Уравнението няма реални корени.";
}

?>
</body>
</html>